Plan

```(tfquickstart) tsharma@MacBook-Pro-8 ex01-nfs_fileshare % terraform plan
module.ex01_nfs_filesahre.data.azurerm_virtual_network.nfs_vnet: Reading...
module.ex01_nfs_filesahre.data.azurerm_subnet.nfs_subnet: Reading...
module.ex01_nfs_filesahre.data.azurerm_virtual_network.nfs_vnet: Read complete after 5s [id=/subscriptions/9c0efd86-d1e7-4bfa-a9fd-fa6f36b92458/resourceGroups/e2eazp1-tf-rmgp/providers/Microsoft.Network/virtualNetworks/e2eazp1-tf-net]
module.ex01_nfs_filesahre.data.azurerm_subnet.nfs_subnet: Read complete after 5s [id=/subscriptions/9c0efd86-d1e7-4bfa-a9fd-fa6f36b92458/resourceGroups/e2eazp1-tf-rmgp/providers/Microsoft.Network/virtualNetworks/e2eazp1-tf-net/subnets/e2eazp1-tf-sbnt-02]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ex01_nfs_filesahre.azurerm_linux_virtual_machine.nfs_vm will be created
  + resource "azurerm_linux_virtual_machine" "nfs_vm" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "francecentral"
      + max_bid_price                                          = -1
      + name                                                   = "azbnknfsvm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "e2eazp1-tf-rmgp"
      + size                                                   = "Standard_F2"
      + virtual_machine_id                                     = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDWW7HfwYMrzlWCx6qHzHd42cUr5d6EEdIRB8rNczHE5+AIumGanJcbJnWNjgNNQJjzDramUP0vEMuTer/gQqZhrAvTVVPATh4BGZRpGQYb62VGw/d8N7JGCQJCO73/NC4AnilD+hHpaEgY6v8uK421XN63ZRyWugR+QdwdUCyq2EyOIC6xNSqLPP+6KQscDTEdkva8mPw2c6BARARVZP/Z91KeO8qUA0JEj1bjajF6yRiI38npwDklGlGMdfuUNDGq8bhP3wEQiMHCdPc3R2z5TQ73GMVfxKEZOZSXPHdbnmKqXGQuGmcMYsmEQDJzssmQ+om2Vao2ORFvtimsd7nqAjUnvlV7t6UEdGHTJnq21MoTrWS7LuG55Zg9o8Iy8vpT1PwuzSwJaPn4x976tcSFy4JeIl/Zg1Xqynxm+iUwoD6OEKNPRsidlEAk7QiFsBdFLuv5kmarvaQdJhJ2OH1IvSJOwjttrnihBtMAp6HG8PoOSqhHsvFZT+fqw42Znts= tsharma@MacBook-Pro-2.local
            EOT
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }
    }

  # module.ex01_nfs_filesahre.azurerm_network_interface.nfsvm_nic will be created
  + resource "azurerm_network_interface" "nfsvm_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "francecentral"
      + mac_address                   = (known after apply)
      + name                          = "azbnknfsvm-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "e2eazp1-tf-rmgp"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/9c0efd86-d1e7-4bfa-a9fd-fa6f36b92458/resourceGroups/e2eazp1-tf-rmgp/providers/Microsoft.Network/virtualNetworks/e2eazp1-tf-net/subnets/e2eazp1-tf-sbnt-02"
        }
    }

  # module.ex01_nfs_filesahre.azurerm_network_interface_security_group_association.nfsvm_nic_sg will be created
  + resource "azurerm_network_interface_security_group_association" "nfsvm_nic_sg" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.ex01_nfs_filesahre.azurerm_network_security_group.nfsvm_sg will be created
  + resource "azurerm_network_security_group" "nfsvm_sg" {
      + id                  = (known after apply)
      + location            = "francecentral"
      + name                = "azbnknfsvm-sg"
      + resource_group_name = "e2eazp1-tf-rmgp"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "allowssh"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # module.ex01_nfs_filesahre.azurerm_private_dns_zone.nfs_privatednszone will be created
  + resource "azurerm_private_dns_zone" "nfs_privatednszone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "e2eazp1-tf-rmgp"
    }

  # module.ex01_nfs_filesahre.azurerm_private_dns_zone_virtual_network_link.nfs_vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "nfs_vnet_link" {
      + id                    = (known after apply)
      + name                  = "azbnk_vnetlink"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "e2eazp1-tf-rmgp"
      + virtual_network_id    = "/subscriptions/9c0efd86-d1e7-4bfa-a9fd-fa6f36b92458/resourceGroups/e2eazp1-tf-rmgp/providers/Microsoft.Network/virtualNetworks/e2eazp1-tf-net"
    }

  # module.ex01_nfs_filesahre.azurerm_private_endpoint.nfs_private_endpoint will be created
  + resource "azurerm_private_endpoint" "nfs_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "francecentral"
      + name                     = "azbnk_e2eazp1-tf-sbnt-02_nfs_private_endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "e2eazp1-tf-rmgp"
      + subnet_id                = "/subscriptions/9c0efd86-d1e7-4bfa-a9fd-fa6f36b92458/resourceGroups/e2eazp1-tf-rmgp/providers/Microsoft.Network/virtualNetworks/e2eazp1-tf-net/subnets/e2eazp1-tf-sbnt-02"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "nfs-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "nfs-privateserviceconnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.ex01_nfs_filesahre.azurerm_public_ip.nfsvm_public_ip will be created
  + resource "azurerm_public_ip" "nfsvm_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "francecentral"
      + name                    = "azbnknfsvm-publicip"
      + resource_group_name     = "e2eazp1-tf-rmgp"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.ex01_nfs_filesahre.azurerm_storage_account.nfs_storage_account will be created
  + resource "azurerm_storage_account" "nfs_storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "FileStorage"
      + account_replication_type          = "LRS"
      + account_tier                      = "Premium"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = false
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "francecentral"
      + min_tls_version                   = "TLS1_2"
      + name                              = "nfsvml11sg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "e2eazp1-tf-rmgp"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
    }

  # module.ex01_nfs_filesahre.azurerm_storage_share.nfs_storage_share will be created
  + resource "azurerm_storage_share" "nfs_storage_share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "NFS"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "100"
      + quota                = 100
      + resource_manager_id  = (known after apply)
      + storage_account_name = "nfsvml11sg"
      + url                  = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```